/*
SQLyog Ultimate v10.00 Beta1
MySQL - 8.0.29 : Database - firewall
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`firewall` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `firewall`;

/*Table structure for table `blacklist` */

DROP TABLE IF EXISTS `blacklist`;

CREATE TABLE `blacklist` (
  `id` int NOT NULL AUTO_INCREMENT,
  `host_number` varchar(30) DEFAULT NULL COMMENT '主机号码',
  `intercept_number` varchar(30) DEFAULT NULL COMMENT '黑名单号码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `blacklist` */

insert  into `blacklist`(`id`,`host_number`,`intercept_number`) values (2,'15555215556','76432198787'),(3,'15555215556','98874325245'),(4,'15555215556','42654736778'),(5,'15555215556','24316574748'),(6,'15555215554','36453285455'),(7,'15555215554','56214357439'),(8,'15555215554','4326262'),(9,'15555215554','67456545454549860'),(11,'15555215554','423526325745'),(12,'15555215554','1244325'),(19,'15555215554','15555215558');

/*Table structure for table `call_logs` */

DROP TABLE IF EXISTS `call_logs`;

CREATE TABLE `call_logs` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(30) DEFAULT NULL COMMENT '联系人昵称',
  `host_number` varchar(30) DEFAULT NULL COMMENT '主机电话',
  `contact_number` varchar(30) DEFAULT NULL COMMENT '联系人电话',
  `time` varchar(50) DEFAULT NULL COMMENT '通话时间',
  `isintercept` tinyint(1) DEFAULT NULL COMMENT '是否被拦截',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `call_logs` */

insert  into `call_logs`(`id`,`name`,`host_number`,`contact_number`,`time`,`isintercept`) values (2,'张三','15555215554','15686365842','2022/10/13 15:12:13',0),(3,'1555215554','15555215554','98654321341','2022/10/15 19:12:13',0),(4,'1555215554','15555215554','67974321324','2022/10/17 18:23:13',0),(5,'张三','15555215554','15686365842','2022/10/19 18:10:19',0),(6,'1555215556','15555215556','69874315266','2022/10/11 38:30:59',0),(7,'卡丽','15555215556','90807263643','2022/10/13 18:10:19',0),(8,'1555215556','15555215556','67349874325','2022/10/14 15:50:05',0),(9,'迪克','15555215556','77676323545','2022/10/16 18:10:19',0),(10,'1555215556','15555215556','43543768785','2022/10/19 17:34:19',0),(11,'迪克','15555215556','77676323545','2022/10/23 56:43:54',0),(12,'1555215556','15555215556','14312557735','2022/10/25 14:23:56',0),(13,'98874325245','15555215556','98874325245','2022/10/26 15:23:34',1),(14,'24316574748','15555215556','24316574748','2022/10/26 23:12:57',1),(15,'42654736778','15555215556','42654736778','2022/10/27 15:23:54',1),(16,'36453285455','15555215554','36453285455','2022/10/20 12:21:45',1),(17,'56214357439','15555215554','56214357439','2022/10/20 19:43:01',1),(18,'zs','17898823454','19090909090','2022/12/13 12:13:13',0),(35,'78924236233','15555215558','78924236233','2022/12/03 12:32:43',0),(59,'15555215558','15555215554','15555215558','2022/12/19 10:49:08',1),(60,'15555215556','15555215554','15555215556','2022/12/19 10:50:04',0),(61,'15555215556','15555215554','15555215556','2022/12/19 10:51:08',1),(62,'15555215558','15555215554','15555215558','2022/12/19 11:00:59',0),(63,'15555215558','15555215554','15555215558','2022/12/19 11:01:58',1),(64,'15555215554','15555215556','15555215554','2022/12/19 15:30:55',0),(65,'15555215554','15555215556','15555215554','2022/12/19 15:47:22',0);

/*Table structure for table `contact` */

DROP TABLE IF EXISTS `contact`;

CREATE TABLE `contact` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(30) DEFAULT NULL COMMENT '联系人昵称',
  `host_number` varchar(30) DEFAULT NULL COMMENT '主机电话',
  `contact_number` varchar(30) DEFAULT NULL COMMENT '联系人电话',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `contact` */

insert  into `contact`(`id`,`name`,`host_number`,`contact_number`) values (2,'zs','17898823454','19090909090'),(3,'zs','17898823454','18080808080'),(4,'张三','15555215554','15686365842'),(5,'吴臣','15555215554','98624354312'),(6,'柯林','15555215554','98745234134'),(7,'爱丽丝','15555215554','76342187943'),(8,'凯文','15555215554','67852435989'),(9,'苏楠','15555215556','56781432984'),(10,'李珊','15555215556','78598983495'),(11,'卡丽','15555215556','90807263643'),(12,'大白熊','15555215556','09864123415'),(13,'凯蒂','15555215556','86932498245'),(14,'刘昭阳','15555215556','09809666238'),(15,'迪克','15555215556','77676323545'),(17,'15555215556','15555215554','15555215556'),(18,'15555215554','15555215558','15555215554'),(19,'78924236233','15555215558','78924236233'),(20,'大虎','15555215558','56689313423');

/*Table structure for table `message_logs` */

DROP TABLE IF EXISTS `message_logs`;

CREATE TABLE `message_logs` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(30) DEFAULT NULL COMMENT '联系人名称',
  `host_number` varchar(30) DEFAULT NULL COMMENT '主机号码',
  `contact_number` varchar(30) DEFAULT NULL COMMENT '联系人号码',
  `message_content` varchar(1000) DEFAULT NULL COMMENT '短信内容',
  `time` varchar(50) DEFAULT NULL COMMENT '发送时间',
  `isintercept` tinyint(1) DEFAULT NULL COMMENT '是否被拦截',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `message_logs` */

insert  into `message_logs`(`id`,`name`,`host_number`,`contact_number`,`message_content`,`time`,`isintercept`) values (2,'爱丽丝','15555215554','76342187943','上班错过公交，于是追着车跑，一个骑着电动车的人在公车旁边喊：“加油啊！ ”我心底突然涌上一股暖流，刚想感慨这世界的美好，那人又接着喊道：“师傅快加油，别让后面这逼追上了！','2022/02/19 18:10:19',0),(3,'13251598831','15555215556','13251598831','今年10月以来，四川省成都市大力开展戏曲进校园活动，精选川剧、京剧、木偶皮影戏等代表中华传统文化精髓的戏曲艺术作品，深入市内大中小学演出，开展戏曲名家讲座，为师生们送去了丰富的精神文化大餐。','2022/03/13 12:15:49',0),(4,'56781432984','15555215554','56781432984','生产企业应按照《移动智能终端应用软件预置和分发管理暂行规定》(工信部信管〔2016〕407号)有关规定，保证预置应用软件安全合规，明示所提供预置应用软件的相关信息，履行登记、审核、监测、留存、下架等全链条管理责任，完善投诉受理制度等服务保障措施，及时处理用户投诉，落实个人信息保护责任。','2022/03/23 23:50:19',0),(5,'爱丽丝','15555215554','76342187943','　“夸父一号”是中国科学院空间科学二期先导专项研制的一颗空间科学卫星，于2022年10月9日成功发射。卫星以“一磁两暴”为科学目标，即同时观测太阳磁场和太阳上两类最剧烈的爆发现象——耀斑和日冕物质抛射，研究它们的形成、演化、相互作用和彼此关联，同时为空间天气预报提供支持。','2022/04/29 13:17:11',0),(6,'87960981342','15555215556','87960981342','荆山楚水，村路“醉”美。近日，获评2021年度“全国十大最美农村路”的湖北省黄冈市蕲春县株林镇绿唐线公路沿线景致怡人，黑色的两车道沥青路面、黄白色的标线、驶过的各色车辆、整洁实用的候车亭，与金黄的银杏叶、骑行打卡的游客、售卖土特产的村民，构成了一幅路畅民乐、路美客来的美丽乡村幸福图景。','2022/07/15 16:10:19',0),(7,'苏楠','15555215556','56781432984','太阳硬X射线成像仪（HXI）实现了我国首次太阳硬X射线成像，这是目前国际上唯一以近地视角拍摄的太阳硬X射线图像，图像总体质量达到国际一流水平。','2022/08/19 18:16:48',0),(8,'15555215554','15555215554','15555215554','莱曼阿尔法太阳望远镜（LST）的3个子载荷之一太阳日面成像仪（SDI），实现了国际首次在卫星平台上获得莱曼阿尔法波段全日面像，其中，日珥的演化图像清晰完整。另一个子载荷太阳白光望远镜（WST），观测到太阳边缘上2个罕见的“白光耀斑”，莱曼阿尔法波段的观测能力得到了验证。','2022/09/19 16:10:45',0),(9,'98361215512','15555215556','98361215512','据国家网信办网站消息，工业和信息化部、国家互联网信息办公室14日发布关于进一步规范移动智能终端应用软件预置行为的通告。通告称，生产企业应确保移动智能终端中除基本功能软件外的预置应用软件均可卸载，并提供安全便捷的卸载方式供用户选择。','2022/09/15 14:34:44',0),(10,'15555215554','15555215556','15555215554','移动智能终端应用软件预置行为应遵循依法合规、用户至上、安全便捷、最小必要的原则，依据谁预置、谁负责的要求，落实企业主体责任，尊重并依法维护用户知情权、选择权，保障用户合法权益。','2022/10/12 23:25:26',0),(11,'76432198787','15555215556','76432198787','第1时间发布热门新闻,解密事件幕后,抓住您的眼球,让您尽知天下事.是国内社交化的资讯阅读微信，能便捷地了解最热门的资讯，并和朋友互动，发表对世界的看法。同时可收集用户关注的热门新闻和感兴趣的新闻，第一时间发现属于用户个人的头条。截至2015年4月注册用户量已经突破30万，是亚洲地区最大用户群体的移动即时通讯微信。','2022/10/12 04:34:52',1),(12,'98874325245','15555215556','98874325245','BBS多用于大型公司或中小型企业，开放给客户交流的平台，对于初识网络的新人来讲，BBS - 就是用于在网络上交流的地方，可以发表一个主题，让大家一起来探讨，也可以提出一个问题，大家一起来解决等，是一个人与人语言文化共享的平台，具有实时性、互动性。随着时代的发展。新新人类的出现。同时也使得论坛成为新型词语或一些不正规的词语飞速蔓延例如：斑竹(版主)。罐水(灌水)，沙发（第一个回帖人），板凳(第二个回贴人)。因此，在交流的时候请注意，同时避免不正规的词语蔓延。','2022/12/10 16:35:56',1),(13,'36453285455','15555215554','36453285455','地方性论坛是论坛中娱乐性与互动性最强的论坛之一。不论是大型论坛中的地方站，还是专业的地方论坛，都有很热烈的网民反向，比如百度长春贴吧、北京贴吧或者是清华大学论坛、一汽公司论坛等，地方性论坛能够更大距离的拉近人与人的沟通，另外由于是地方性的论坛，所以对其中的网民也有了一定行的局域限制，论坛中的人或多或少都来自于相同的地方，这样即有那么点点的真实的安全感，也少不了网络特有的朦胧感，所以这样的论坛常常受到网民的欢迎。','2022/10/11 13:43:34',1),(14,'36453285455','15555215554','36453285455','中国惠多网 盛行于1993年至1998年间，高峰时期全国有上百个站点，使用者达上万人。有名的BBS有北京的轻松快车、长城、西点军校、天堂、舒克，广州的新月、深圳的DataExpress、珠海的西点。CFido的网友算是中国最早的网民，后来多个CFido网友成为中国互联网名人，比如腾讯的马化腾当时就是深圳的DataExpress的站长，而金山软件公司的求伯君是珠海西点的站长。发表“金州不相信眼泪！”而成名，后来担任8848网站董事长的网友老榕（王峻涛）是福州站的站长。','2022/10/11 15:32:45',1),(15,'56214357439','15555215554','56214357439','调制解调器，是调制器和解调器的缩写 ，一种计算机硬件 [1]  ，它能把计算机的数字信号翻译成可沿普通电话线传送的模拟信号，而这些模拟信号又可被线路另一端的另一个调制解调器接收，并译成计算机可懂的语言。这一简单过程完成了两台计算机间的通信。','2022/10/13 23:55:23',1),(16,'56214357439','15555215554','56214357439','模拟信号是指用连续变化的物理量表示的信息，其信号的幅度，或频率，或相位随时间作连续变化，或在一段连续的时间间隔内，其代表信息的特征量可以在任意瞬间呈现为任意数值的信号。','2022/10/13 23:58:43',1),(17,'苏楠','15555215556','56781432984','抽象是从众多的事物中抽取出共同的、本质性的特征，而舍弃其非本质的特征的过程。具体地说，抽象就是人们在实践的基础上，对于丰富的感性材料通过去粗取精、去伪存真、由此及彼、由表及里的加工制作，形成概念、判断、推理等思维形式，以反映事物的本质和规律的方法。','2022/10/14 06:32:24',0),(40,'15555215558','15555215554','15555215558','55581','2022/12/19 10:49:36',1),(41,'15555215556','15555215554','15555215556','55561','2022/12/19 10:50:24',0),(42,'15555215556','15555215554','15555215556','55562','2022/12/19 10:51:19',1),(43,'15555215558','15555215554','15555215558','55582','2022/12/19 11:01:22',0),(44,'15555215558','15555215554','15555215558','55583','2022/12/19 11:02:15',1);

/*Table structure for table `message_permission` */

DROP TABLE IF EXISTS `message_permission`;

CREATE TABLE `message_permission` (
  `id` int NOT NULL AUTO_INCREMENT,
  `host_number` varchar(30) DEFAULT NULL,
  `allmessage` tinyint(1) DEFAULT NULL,
  `strangemessage` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `message_permission` */

insert  into `message_permission`(`id`,`host_number`,`allmessage`,`strangemessage`) values (1,'15555215554',0,1),(2,'15555215556',0,0);

/*Table structure for table `permission` */

DROP TABLE IF EXISTS `permission`;

CREATE TABLE `permission` (
  `id` int NOT NULL AUTO_INCREMENT,
  `host_number` varchar(20) DEFAULT NULL,
  `allphone` tinyint(1) DEFAULT NULL,
  `strangephone` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

/*Data for the table `permission` */

insert  into `permission`(`id`,`host_number`,`allphone`,`strangephone`) values (1,'15555215556',0,0),(2,'15555215554',0,1);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
